tylertms/dspic33e-sim/conformance/interrupt_control.c
    dspic33_write_word(cpu, INTCON2, 0u);
    expect(state,
           dspic33_read_word(cpu, INTCON2) == 0u &&
               dspic33_read_word(cpu, INTCON4) == 1u && pending_trap(cpu, 2u) != NULL,
           "clearing SWTRAP leaves SGHT hard source active");
    cpu->stop_reason = DSPIC33_RUNNING;
    expect(state, dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->trap_count == 2u,
           "persistent SGHT reenters after RETFIE");

    dspic33_write_word(cpu, INTCON4, 0u);
    expect(state, pending_trap(cpu, 2u) == NULL,
           "clearing final hard source cancels reentry");
    cpu->stop_reason = DSPIC33_RUNNING;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
               cpu->interrupt_depth == 0u,
           "RETFIE returns after hard sources clear");
}

static void generic_soft_cases(InterruptControlConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0u, OPCODE_MOV_W0_INTCON3);
    dspic33_load_program_word(cpu, 0x0010u, 0x000320u);
    dspic33_load_program_word(cpu, 0x0320u, OPCODE_RETFIE);
    dspic33_set_working_register(cpu, 0u, 0x0070u);
    dspic33_set_working_register(cpu, 15u, 0x3000u);
    cpu->sr = 0x0105u;
    cpu->stop_on_trap = true;
    expect(state, dspic33_step(cpu) == DSPIC33_TRAPPED,
           "INTCON3 instruction dispatches generic soft trap");
    expect(state, dspic33_read_word(cpu, INTCON3) == 0x0070u,
           "generic soft sources retain all requested status bits");
    expect(state,
           cpu->last_trap == 6u && cpu->last_trap_return == 2u && cpu->pc == 0x0320u &&
               cpu->trap_count == 1u,
           "generic soft trap coalesces sources at vector sixteen");
    expect(state,
           dspic33_read_word(cpu, INTTREG) == 0x0906u &&
               (cpu->sr & 0x00e0u) == 0x0020u && (cpu->corcon & 0x0008u) != 0u,
           "generic soft trap enters priority nine");
    expect(state,
           dspic33_read_word(cpu, 0x3000u) == 2u &&
               dspic33_read_word(cpu, 0x3002u) == 0x0500u && cpu->w[15] == 0x3004u,
           "generic soft trap stacks completed instruction state");

    dspic33_write_word(cpu, INTCON3, 0u);
    expect(state, pending_trap(cpu, 6u) == NULL,
           "clearing generic soft sources cancels reentry");
    cpu->stop_reason = DSPIC33_RUNNING;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
               cpu->interrupt_depth == 0u,
           "RETFIE returns after soft sources clear");
}

static void external_interrupt_edge_cases(InterruptControlConformance* state,
                                          Dspic33* cpu) {
    uint8_t channel;
    prepare_external_interrupts(cpu, 0u, 0u);
    for (channel = 0u; channel < DSPIC33_EXTERNAL_INTERRUPT_COUNT; channel++) {
        uint8_t irq = external_interrupt_irqs[channel];
        uint16_t pin = external_interrupt_pins[channel];
        dspic33_gpio_drive(cpu, 3u, pin, pin);
        expect(state, external_interrupt_flags(cpu) == (uint8_t)(1u << channel),
               "positive INT edge raises only its matching flag");
        clear_interrupt(cpu, irq);
        dspic33_gpio_drive(cpu, 3u, pin, pin);
        expect(state, !interrupt_flag(cpu, irq),
               "stable high INT input does not retrigger");
        dspic33_gpio_drive(cpu, 3u, 0u, pin);
        expect(state, !interrupt_flag(cpu, irq),
               "falling edge does not match positive polarity");
    }

    prepare_external_interrupts(cpu, 0x001fu, 0x001fu);
    for (channel = 0u; channel < DSPIC33_EXTERNAL_INTERRUPT_COUNT; channel++) {
        uint8_t irq = external_interrupt_irqs[channel];
        uint16_t pin = external_interrupt_pins[channel];
        dspic33_gpio_drive(cpu, 3u, 0u, pin);
        expect(state, external_interrupt_flags(cpu) == (uint8_t)(1u << channel),
               "negative INT edge raises only its matching flag");
        clear_interrupt(cpu, irq);
        dspic33_gpio_drive(cpu, 3u, 0u, pin);
        expect(state, !interrupt_flag(cpu, irq),
               "stable low INT input does not retrigger");
        dspic33_gpio_drive(cpu, 3u, pin, pin);
        expect(state, !interrupt_flag(cpu, irq),
               "rising edge does not match negative polarity");
    }

    prepare_external_interrupts(cpu, 0u, 0u);
    dspic33_write_byte(cpu, INTCON2, 0x1fu);
    expect(state,
           !interrupt_flag(cpu, 0u) && !interrupt_flag(cpu, 20u) &&
               !interrupt_flag(cpu, 29u) && !interrupt_flag(cpu, 53u) &&
               !interrupt_flag(cpu, 54u),
           "polarity reconfiguration does not synthesize an edge");
}

static void external_interrupt_selection_cases(InterruptControlConformance* state,
                                               Dspic33* cpu) {
    prepare_external_interrupts(cpu, 0u, 0u);
    dspic33_gpio_drive(cpu, 3u, 0x0020u, 0x0020u);
    dspic33_write_byte(cpu, RPINR0 + 1u, 69u);
    expect(state,
           !interrupt_flag(cpu, 20u) &&
               cpu->io.external_interrupt_selection[1] == 69u &&
               (cpu->io.external_interrupt_levels & 0x02u) != 0u,
           "INT1 remap baselines the selected high pin");
    dspic33_write_word(cpu, INTCON2, 0x8002u);
    dspic33_gpio_drive(cpu, 3u, 0u, 0x0020u);
    expect(state, interrupt_flag(cpu, 20u), "remapped INT1 detects the selected edge");

    clear_interrupt(cpu, 20u);
    dspic33_write_word(cpu, RPINR0, 48u << 8u);
    dspic33_gpio_drive(cpu, 3u, 0x0020u, 0x0020u);
    expect(state,
           !interrupt_flag(cpu, 20u) &&
               (cpu->io.external_interrupt_qualified & 0x02u) == 0u,
           "unimplemented PPS selection cannot drive INT1");
    dspic33_write_word(cpu, RPINR0, 0u);
    expect(state,
           !interrupt_flag(cpu, 20u) &&
               (cpu->io.external_interrupt_qualified & 0x02u) != 0u &&
               (cpu->io.external_interrupt_levels & 0x02u) == 0u,
           "PPS selection zero ties INT1 to VSS without an edge");

    prepare_external_interrupts(cpu, 0u, 0u);
    dspic33_write_word(cpu, RPINR0, 1u << 8u);
    dspic33_comparator_input(cpu, 0u, DSPIC33_COMPARATOR_INPUT_POSITIVE, 0u, 0u);
    dspic33_comparator_input(cpu, 0u, DSPIC33_COMPARATOR_INPUT_NEGATIVE_2, 100u, 0u);
    dspic33_device_advance(cpu, 0u);
    dspic33_write_word(cpu, COMPARATOR1_CONTROL, 0x8000u);
    clear_interrupt(cpu, 20u);
    dspic33_comparator_input(cpu, 0u, DSPIC33_COMPARATOR_INPUT_POSITIVE, 200u, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, interrupt_flag(cpu, 20u), "CMP1 rising output drives selected INT1");
    clear_interrupt(cpu, 20u);
    dspic33_write_word(cpu, INTCON2, 0x8002u);
    dspic33_comparator_input(cpu, 0u, DSPIC33_COMPARATOR_INPUT_POSITIVE, 0u, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, interrupt_flag(cpu, 20u), "CMP1 falling output drives selected INT1");

    prepare_external_interrupts(cpu, 0u, 0u);
    dspic33_write_word(cpu, TRISD, (uint16_t)(UINT16_MAX & ~0x0002u));
    dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x0002u);
    expect(state, !interrupt_flag(cpu, 20u), "output mode suppresses INT1 input edges");
    dspic33_write_word(cpu, TRISD, UINT16_MAX);
    expect(state, !interrupt_flag(cpu, 20u),
           "input qualification baselines INT1 level");
    dspic33_gpio_drive(cpu, 3u, 0u, 0x0002u);
    dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x0002u);
    expect(state, interrupt_flag(cpu, 20u),
           "qualified digital input restores INT1 edges");

    clear_interrupt(cpu, 20u);
    dspic33_write_word(cpu, ANSELD, 0x0002u);
    dspic33_gpio_drive(cpu, 3u, 0u, 0x0002u);
    expect(state, !interrupt_flag(cpu, 20u), "analog mode suppresses INT1 input edges");
    dspic33_write_word(cpu, ANSELD, 0u);
    expect(state, !interrupt_flag(cpu, 20u),
           "digital qualification rebaselines INT1 level");
    dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x0002u);
    expect(state, interrupt_flag(cpu, 20u), "digital mode restores INT1 input edges");
}

static void configure_output_compare_trigger(Dspic33* cpu, uint8_t source) {
    dspic33_write_word(cpu, OUTPUT_COMPARE16_CONTROL1, 0u);
    dspic33_write_word(cpu, OUTPUT_COMPARE16_CONTROL2, 0u);
    dspic33_write_word(cpu, OUTPUT_COMPARE16_SECONDARY, 4u);
    dspic33_write_word(cpu, OUTPUT_COMPARE16_PRIMARY, 2u);
    dspic33_write_word(cpu, OUTPUT_COMPARE16_CONTROL1,
                       OUTPUT_COMPARE_FP | OUTPUT_COMPARE_EDGE_PWM);
    dspic33_write_word(cpu, OUTPUT_COMPARE16_CONTROL2,
                       (uint16_t)(OUTPUT_COMPARE_TRIGGER | source));
}

static void configure_dma_request(Dspic33* cpu, uint8_t request, uint16_t source) {
    dspic33_write_word(cpu, source, 0x5aa5u);
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, request);
    dspic33_write_word(cpu, 0x0b04u, source);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, DMA_TEST_PAD);
    dspic33_write_word(cpu, 0x0b0eu, 0u);
    dspic33_write_word(cpu, 0x0b00u, 0xa001u);
}

static void external_interrupt_interaction_cases(InterruptControlConformance* state,
                                                 Dspic33* cpu) {
    prepare_external_interrupts(cpu, 0u, 0u);
    configure_dma_request(cpu, 0u, 0x2200u);
    dspic33_gpio_drive(cpu, 3u, 0x0001u, 0x0001u);
    expect(state,
           interrupt_flag(cpu, 0u) && (cpu->io.dma_peripheral_pending & 1u) != 0u,
           "INT0 edge raises its interrupt and DMA request");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, DMA_TEST_PAD) == 0x5aa5u,
           "INT0 DMA request performs the configured transfer");

    prepare_external_interrupts(cpu, 0u, 0u);
    configure_dma_request(cpu, 20u, 0x2202u);
    dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x0002u);
    expect(state,
           interrupt_flag(cpu, 20u) && cpu->io.dma_peripheral_pending == 0u &&
               dspic33_read_word(cpu, DMA_TEST_PAD) == 0u,
           "INT1 edge does not produce an unsupported DMA request");

    prepare_external_interrupts(cpu, 0u, 0u);
    dspic33_adc_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0320u, 0u);
    dspic33_write_word(cpu, 0x0322u, 0u);
    dspic33_write_word(cpu, 0x0328u, 0u);
    dspic33_write_word(cpu, 0x0320u, 0x8010u);
    dspic33_write_word(cpu, 0x0320u, 0x8012u);
    dspic33_gpio_drive(cpu, 3u, 0x0001u, 0x0001u);
    expect(state,
           dspic33_device_advance(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x0320u) & 0x0002u) == 0u,
           "INT0 edge starts the selected ADC conversion");
    expect(state,
           dspic33_device_advance(cpu, 12u) &&
               dspic33_read_word(cpu, 0x0300u) == 100u &&
               (dspic33_read_word(cpu, 0x0320u) & 0x0001u) == 0u,
           "INT0 conversion completes with the B1 DONE behavior");

    prepare_external_interrupts(cpu, 0u, 0u);
    configure_output_compare_trigger(cpu, 29u);
    dspic33_gpio_drive(cpu, 3u, 0x0002u, 0x0002u);
    expect(state,
           interrupt_flag(cpu, 20u) &&
               (dspic33_read_word(cpu, OUTPUT_COMPARE16_CONTROL2) &
                OUTPUT_COMPARE_TRIGGER_STATUS) != 0u,
           "INT1 pin edge triggers its selected Output Compare source");

    prepare_external_interrupts(cpu, 0u, 0u);
    configure_output_compare_trigger(cpu, 30u);
    dspic33_gpio_drive(cpu, 3u, 0x0004u, 0x0004u);
    expect(state,
           interrupt_flag(cpu, 29u) &&
               (dspic33_read_word(cpu, OUTPUT_COMPARE16_CONTROL2) &
                OUTPUT_COMPARE_TRIGGER_STATUS) != 0u,
           "INT2 pin edge triggers its selected Output Compare source");
}

static void external_interrupt_wake_lifecycle_cases(InterruptControlConformance* state,
                                                    Dspic33* source, Dspic33* copy) {
    prepare_external_interrupts(source, 0u, 0u);
    enable_interrupt(source, 20u, 0u, 0x04e0u);
    source->power_state = DSPIC33_POWER_SLEEP;
    dspic33_gpio_drive(source, 3u, 0x0002u, 0x0002u);
    expect(state,
           interrupt_flag(source, 20u) && !dspic33_device_wake(source) &&
               source->power_state == DSPIC33_POWER_SLEEP,
           "priority-zero external interrupt cannot wake from Sleep");

    prepare_external_interrupts(source, 0u, 0u);
    enable_interrupt(source, 53u, 3u, 0x0500u);
    source->w[15] = 0x1800u;
    source->sr = 0x0040u;
    source->power_state = DSPIC33_POWER_SLEEP;
    dspic33_gpio_drive(source, 3u, 0x0008u, 0x0008u);
    expect(state,
           dspic33_device_wake(source) && source->last_interrupt == 53u &&
               source->pc == 0x0500u && source->w[15] == 0x1804u,
           "higher-priority INT3 edge wakes through its documented vector");
    expect(state, dspic33_read_word(source, INTTREG) == 0x033du,
           "INT3 wake latches its vector number and priority");

    prepare_external_interrupts(source, 0u, 0u);
    enable_interrupt(source, 54u, 2u, 0x0520u);
    source->w[15] = 0x1900u;
    source->sr = 0x0040u;
    source->power_state = DSPIC33_POWER_IDLE;
    dspic33_gpio_drive(source, 3u, 0x0010u, 0x0010u);
    expect(state,
           dspic33_device_wake(source) && source->interrupt_count == 0u &&
               source->w[15] == 0x1900u && interrupt_flag(source, 54u),
           "equal-priority INT4 edge wakes from Idle without a frame");
    source->sr = 0u;
    expect(state,
           dspic33_device_service_interrupt(source) && source->last_interrupt == 54u &&
               source->pc == 0x0520u,
           "retained INT4 flag vectors after lowering IPL");

    prepare_external_interrupts(source, 0u, 0u);
    expect(state, dspic33_copy(copy, source), "copy preserves external INT state");
    dspic33_gpio_drive(source, 3u, 0x0002u, 0x0002u);
    expect(state,
           interrupt_flag(source, 20u) && !interrupt_flag(copy, 20u) &&
               source->io.external_interrupt_levels !=
                   copy->io.external_interrupt_levels,
           "copied external INT edge state diverges independently");

    clear_external_interrupts(source);
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state,
           dspic33_step(source) == DSPIC33_RUNNING &&
               dspic33_read_word(source, RPINR0) == 0u &&
               source->io.external_interrupt_selection[1] == 0u &&
               !interrupt_flag(source, 20u),
           "warm reset clears INT remap and rebaselines retained pins");
    dspic33_write_word(source, ANSELD, 0u);
    dspic33_write_word(source, TRISD, UINT16_MAX);
    dspic33_write_word(source, RPINR0, 65u << 8u);
    expect(state, !interrupt_flag(source, 20u),
           "warm-reset remap baselines the retained high pin");
    dspic33_gpio_drive(source, 3u, 0u, 0x0002u);
    dspic33_gpio_drive(source, 3u, 0x0002u, 0x0002u);
    expect(state, interrupt_flag(source, 20u),
           "warm-reset external INT state detects later edges");

    dspic33_reset(source, 0u);
    expect(state,
           source->io.external_interrupt_selection[0] == 64u &&
               source->io.external_interrupt_selection[1] == 0u &&
               source->io.external_interrupt_qualified == 0x1fu &&
               source->io.external_interrupt_levels == 0u,
           "POR restores fixed INT0 and VSS-remapped INT1 through INT4 state");
}

static void lifecycle_cases(InterruptControlConformance* state, Dspic33* source,
                            Dspic33* copy) {
    dspic33_reset(source, 0u);
    dspic33_reset(copy, 0u);
    dspic33_write_word(source, INTCON1, 0x7800u);
    dspic33_device_latch_interrupt(source, 2u, 13u);
    expect(state, dspic33_copy(copy, source), "copy preserves interrupt controls");
    expect(state,
           dspic33_read_word(copy, INTCON1) == 0x7800u &&
               dspic33_read_word(copy, INTTREG) == 0x0d02u,
           "copy preserves interrupt status and dynamic latch");
    dspic33_write_word(source, INTCON1, 0u);
    expect(state, dspic33_read_word(copy, INTCON1) == 0x7800u,
           "copied interrupt status is independent");
    dspic33_reset(source, 0u);
    expect(state,
           dspic33_read_word(source, INTCON1) == 0u &&
               dspic33_read_word(source, INTCON2) == 0x8000u &&
               dspic33_read_word(source, INTCON3) == 0u &&
               dspic33_read_word(source, INTCON4) == 0u &&
               dspic33_read_word(source, INTTREG) == 0u,
           "POR restores interrupt-control state");
}

int main(void) {
    Dspic33 source;
    Dspic33 copy;
    InterruptControlConformance state = {0u, 0u, 0u};
    if (!dspic33_initialize(&source) || !dspic33_initialize(&copy)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    access_cases(&state, &source);
    generic_hard_cases(&state, &source);
    generic_soft_cases(&state, &source);
    external_interrupt_edge_cases(&state, &source);
    external_interrupt_selection_cases(&state, &source);
    external_interrupt_interaction_cases(&state, &source);
    external_interrupt_wake_lifecycle_cases(&state, &source, &copy);
    lifecycle_cases(&state, &source, &copy);
    expect(&state, state.cases == 102u, "interrupt-control assertion accounting");
    printf("[interrupt-control-summary] cases=%" PRIu32 " passed=%" PRIu32
           " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&copy);
    dspic33_destroy(&source);
    return state.failed == 0u ? 0 : 1;
}
